Ran Plan for dir: `webserver-cluster` workspace: `default`

<details><summary>Show Output</summary>

```diff
Acquiring state lock. This may take a few moments...
aws_security_group.instance: Refreshing state... [id=sg-0b9cea0fb981bea61]
aws_security_group.alb: Refreshing state... [id=sg-06e99dc465e8ff49f]
aws_launch_configuration.example: Refreshing state... [id=terraform-20210113111725869800000001]
aws_lb_target_group.asg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:869946923544:targetgroup/terraform-asg-example/9b4258759c8a15ae]
aws_lb.example: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:869946923544:loadbalancer/app/terraform-asg-example/8e308acfd6c5ddde]
aws_autoscaling_group.example: Refreshing state... [id=tf-asg-20210113110138416800000002]
aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:869946923544:listener/app/terraform-asg-example/8e308acfd6c5ddde/c5ab34dc1c703283]
aws_lb_listener_rule.asg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:869946923544:listener-rule/app/terraform-asg-example/8e308acfd6c5ddde/c5ab34dc1c703283/73312fb361543463]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_autoscaling_group.example will be updated in-place
~ resource "aws_autoscaling_group" "example" {
        id                        = "tf-asg-20210113110138416800000002"
      ~ launch_configuration      = "terraform-20210113111725869800000001" -> (known after apply)
        name                      = "tf-asg-20210113110138416800000002"
        # (21 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_launch_configuration.example must be replaced
+/- resource "aws_launch_configuration" "example" {
      ~ arn                              = "arn:aws:autoscaling:us-east-2:869946923544:launchConfiguration:e11d9c97-f045-48eb-8c24-b6d6926cf614:launchConfigurationName/terraform-20210113111725869800000001" -> (known after apply)
      ~ ebs_optimized                    = false -> (known after apply)
      ~ id                               = "terraform-20210113111725869800000001" -> (known after apply)
      + key_name                         = (known after apply)
      ~ name                             = "terraform-20210113111725869800000001" -> (known after apply)
      ~ user_data                        = "12a3d2aefe6f17fca384cf0463417dff653ff0ab" -> "f52c8f250f5dc38855cac396846a7001e19b047c" # forces replacement
      - vpc_classic_link_security_groups = [] -> null
        # (5 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.
Releasing state lock. This may take a few moments...

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d webserver-cluster`
* :put_litter_in_its_place: To **delete** this plan click [here](https://dae0d43ebe9f.ngrok.io/lock?id=jonico%252Fatlantis-example%252Fwebserver-cluster%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d webserver-cluster`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
